<?php
return array(
    'main' => array(
        'title' => 'Óïğàâëåíèå ìèãğàöèÿìè',
        'list' => 'Ïåğå÷åíü ìèãğàöèé äëÿ ïğèìåíåíèÿ',
        'version' => 'Òåêóùàÿ âåğñèÿ áàçû äàííûõ',
        'change_link' => 'ñìåíèòü âåğñèş',
        'errorList' => 'Íåóäà÷íî ïğèìåíåííûå ìèãğàöèè',
        'appliedList' => 'Óäà÷íî ïğèìåíåííûå ìèãğàöèè',
        'btnRollback' => 'Îòêàòèòü ïîñëåäíèå èçìåíåíèÿ',
        'lastSetup' => array(
            'sectionName' => 'Ïîñëåäíåå îáíîâëåíèå :time: - :user:'
        ),
        'common' => array(
            'listEmpty' => 'Ñïèñîê ïóñò'
        ),
        'newChangesDetail' => 'ïîäğîáíî',
        'newChangesTitle' => 'Ñïèñîê èçìåíåíèé'
    ),
    'changeversion' => array(
        'title' => 'Òåêóùàÿ âåğñèÿ',
        'version' => 'Òåêóùàÿ âåğñèÿ ïëàòôîğìû',
        'setup' => 'óñòàíîâèòü',
        'owner' => 'Âëàäåëåö',
        'button_change' => 'Ñìåíèòü',
        'description' => "
        Ïğè ïğèìåíåíèè \"×èñòîãî äàìïà\" íåîáõîäèìî ïğîñòî ñìåíèòü âåğñèş áàçû äàííûõ, â òåêóùåì ïğîåêòå èçìåíèòñÿ âåğñèÿ, êîòîğàÿ áóäåò ôóíêöèîíèğîâàòü ñàìîñòîÿòåëüíî.
        ",
        'dialog' => array(
            'title' => 'Óñòàíîâêà èìåíè âëàäåëüöà âåğñèè ïğîåêòà'
        ),
        'otherVersions' => array(
            'tab' => 'Ñòîğîííèå âåğñèè'
        )
    ),
    'export' => array(
        'title' => 'İêñïîğò ìèãğàöèé',
        'version' => 'Òåêóùàÿ âåğñèÿ áàçû äàííûõ'
    ),
    'import' => array(
        'title' => 'Èìïîğò ìèãğàöèé',
        'version' => 'Òåêóùàÿ âåğñèÿ áàçû äàííûõ',
        'description' => "Ïåğåíîñ ñõåìû äàííûõ

        Ïğè ïğèìåíåíèè \"×èñòîãî äàìïà\" íåîáõîäèìî ïğîñòî ïğèìåíèòü èìïîğò (áåç èñïîëüçîâàíèÿ ñõåìû), â òåêóùåì ïğîåêòå èçìåíèòñÿ âåğñèÿ, êîòîğàÿ áóäåò ôóíêöèîíèğîâàòü ñàìîòîÿòåëüíî.

        Ñõåìà èñïîëüçóåòñÿ äëÿ ñîçäàíèÿ íîâûõ äàííûõ ñ ó÷åòîì èìåşùèõñÿ, ò.å. ïóòåì ñîçäàíèÿ íîâûõ ìîäåëåé çàïèñåé, â ñëó÷àå íàëè÷èÿ ñîîòâåòñòâèé âåğñèé èìïîğòèğóåìûõ çàïèñåé íîâûå äàííûå ñõåìû ñîçäàâàòüñÿ íå áóäóò, îíè òîëüêî ìîäèôèöèğóşòñÿ ñîãëàñíî èìïîğòó.
        ",
        'fields' => array(
            'file' => 'Ôàéë èìïîğòà (âåğñèÿ.json)',
            'isScheme' => 'Ïåğåíîñ òîëüêî ñõåìû'
        )
    ),
    'log' => array(
        'title' => 'Æóğíàë èçìåíåíèé',
        'fields' => array(
            'updateDate' => 'Äàòà ïğèìåíåíèÿ',
            'description' => 'Îïèñàíèå',
            'source' => 'Èñòî÷íèê',
            'dispatcher' => 'Ïğèìåíèë'
        ),
        'messages' => array(
            'InsertReference' => 'Âñòàâêà ññûëêè ñòîğîííåãî èñòî÷íèêà',
            'view' => 'Àíàëèç èçìåíåíèé',
            'pages' => 'Ñòğàíèöû',
            'actualization' => 'Àêòóàëèçàöèÿ èñòî÷íèêîâ'
        )
    ),
    'detail' => array(
        'title' => '#date. #source. Îáíîâèë - #deployer',
        'tabs' => array(
            'diff' => 'Èçìåíåíèÿ',
            'final' => 'Äàííûå èçìåíåíèÿ',
            'merge' => 'Ñîñòîÿíèå äî èçìåíåíèé'
        ),
        'message' => array(
            'nobody' => 'Íåáûëî ïğèìåíåíèÿ'
        )
    ),
    'newChangesList' => array(
        'fields' => array(
            'date' => 'Ñîçäàíèå',
            'description' => 'Îïèñàíèå',
            'source' => 'Èñòî÷íèê',
        ),
        'message' => array(
            "ago" => 'íàçàä',
            'view' => 'Ïîäğîáíî'
        )
    ),
    'applyError' => array(
    )
);
